ir_version: 7
producer_name: "tf2onnx+onnx_optimizer"
producer_version: "1.8.5+0.8"
model_version: 0
graph {
  name: "tf2onnx"
  node {
    input: "input_image_with_alpha:0"
    input: "ConstantFolding/WireFrameModel_with_alpha/tf_op_layer_RealDiv/RealDiv_recip:0"
    output: "WireFrameModel_with_alpha/tf_op_layer_RealDiv/RealDiv:0"
    name: "WireFrameModel_with_alpha/tf_op_layer_RealDiv/RealDiv"
    op_type: "Mul"
  }
  node {
    input: "WireFrameModel_with_alpha/tf_op_layer_RealDiv/RealDiv:0"
    input: "WireFrameModel_with_alpha/tf_op_layer_Sub/Sub/y:0"
    output: "WireFrameModel_with_alpha/tf_op_layer_Sub/Sub:0"
    name: "WireFrameModel_with_alpha/tf_op_layer_Sub/Sub"
    op_type: "Sub"
  }
  node {
    input: "WireFrameModel_with_alpha/tf_op_layer_Sub/Sub:0"
    output: "Conv2D__10:0"
    name: "Conv2D__10"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Conv2D__10:0"
    input: "Conv2D/filter:0"
    input: "Add/y:0"
    output: "Conv__275:0"
    name: "Conv__275"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Conv__275:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/Conv1_relu/Relu6_WireFrameModel_with_alpha/bn_Conv1/FusedBatchNormV3_WireFrameModel_with_alpha/block_5_project/Conv2D_WireFrameModel_with_alpha/Conv1_with_alpha/Conv2D:0"
    name: "WireFrameModel_with_alpha/Conv1_relu/Relu6_WireFrameModel_with_alpha/bn_Conv1/FusedBatchNormV3_WireFrameModel_with_alpha/block_5_project/Conv2D_WireFrameModel_with_alpha/Conv1_with_alpha/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/Conv1_relu/Relu6_WireFrameModel_with_alpha/bn_Conv1/FusedBatchNormV3_WireFrameModel_with_alpha/block_5_project/Conv2D_WireFrameModel_with_alpha/Conv1_with_alpha/Conv2D:0"
    input: "const_fold_opt__409"
    input: "Add_1/y:0"
    output: "Conv__276:0"
    name: "Conv__276"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 32
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Conv__276:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/expanded_conv_depthwise_relu/Relu6_WireFrameModel_with_alpha/expanded_conv_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/expanded_conv_depthwise/depthwise_WireFrameModel_with_alpha/block_5_project/Conv2D:0"
    name: "WireFrameModel_with_alpha/expanded_conv_depthwise_relu/Relu6_WireFrameModel_with_alpha/expanded_conv_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/expanded_conv_depthwise/depthwise_WireFrameModel_with_alpha/block_5_project/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/expanded_conv_depthwise_relu/Relu6_WireFrameModel_with_alpha/expanded_conv_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/expanded_conv_depthwise/depthwise_WireFrameModel_with_alpha/block_5_project/Conv2D:0"
    input: "Conv2D_1/filter:0"
    input: "WireFrameModel_with_alpha/expanded_conv_project_BN/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv2d/Conv2D_WireFrameModel_with_alpha/expanded_conv_project/Conv2D1/y:0"
    output: "Conv__277:0"
    name: "Conv__277"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__277:0"
    input: "Conv2D_39/filter:0"
    input: "Add_39/y:0"
    output: "Conv__280:0"
    name: "Conv__280"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__277:0"
    input: "Conv2D_2/filter:0"
    input: "Add_2/y:0"
    output: "Conv__285:0"
    name: "Conv__285"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__280:0"
    output: "WireFrameModel_with_alpha/decoder_fpn/upblock_3/conv_bn__act_12/re_lu_12/Relu_WireFrameModel_with_alpha/decoder_fpn/upblock_3/conv_bn__act_12/bn/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv_bn__act_17/conv/Conv2D_WireFrameModel_with_alpha/decoder_fpn/upblock_3/conv_bn__act_12/conv/Conv2D:0"
    name: "WireFrameModel_with_alpha/decoder_fpn/upblock_3/conv_bn__act_12/re_lu_12/Relu_WireFrameModel_with_alpha/decoder_fpn/upblock_3/conv_bn__act_12/bn/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv_bn__act_17/conv/Conv2D_WireFrameModel_with_alpha/decoder_fpn/upblock_3/conv_bn__act_12/conv/Conv2D"
    op_type: "Relu"
  }
  node {
    input: "Conv__285:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_1_expand_relu/Relu6_WireFrameModel_with_alpha/block_1_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_WireFrameModel_with_alpha/block_1_expand/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_1_expand_relu/Relu6_WireFrameModel_with_alpha/block_1_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_WireFrameModel_with_alpha/block_1_expand/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_1_expand_relu/Relu6_WireFrameModel_with_alpha/block_1_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_WireFrameModel_with_alpha/block_1_expand/Conv2D:0"
    input: "const_fold_opt__419"
    input: "Add_3/y:0"
    output: "Conv__288:0"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 96
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Conv__288:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D:0"
    input: "Conv2D_3/filter:0"
    input: "WireFrameModel_with_alpha/block_1_project_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_2_project/Conv2D_WireFrameModel_with_alpha/block_1_project/Conv2D1/y:0"
    output: "Conv__289:0"
    name: "Conv__289"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__289:0"
    input: "Conv2D_4/filter:0"
    input: "Add_4/y:0"
    output: "Conv__292:0"
    name: "Conv__292"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__292:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_2_expand_relu/Relu6_WireFrameModel_with_alpha/block_2_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_2_expand/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_2_expand_relu/Relu6_WireFrameModel_with_alpha/block_2_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_2_expand/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_2_expand_relu/Relu6_WireFrameModel_with_alpha/block_2_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_2_expand/Conv2D:0"
    input: "const_fold_opt__397"
    input: "Add_5/y:0"
    output: "Conv__293:0"
    name: "Conv__293"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 144
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Conv__293:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_2_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_2_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_2_depthwise/depthwise:0"
    name: "WireFrameModel_with_alpha/block_2_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_2_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_2_depthwise/depthwise"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_2_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_2_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_2_depthwise/depthwise:0"
    input: "Conv2D_5/filter:0"
    input: "WireFrameModel_with_alpha/block_2_project_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_2_project/Conv2D1/y:0"
    output: "Conv__294:0"
    name: "Conv__294"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__289:0"
    input: "Conv__294:0"
    output: "WireFrameModel_with_alpha/block_2_add/add:0"
    name: "WireFrameModel_with_alpha/block_2_add/add"
    op_type: "Add"
  }
  node {
    input: "WireFrameModel_with_alpha/block_2_add/add:0"
    input: "Conv2D_6/filter:0"
    input: "Add_6/y:0"
    output: "Conv__295:0"
    name: "Conv__295"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "WireFrameModel_with_alpha/block_2_add/add:0"
    input: "Conv2D_35/filter:0"
    input: "Add_35/y:0"
    output: "Conv__372:0"
    name: "Conv__372"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__295:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_3_expand_relu/Relu6_WireFrameModel_with_alpha/block_3_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_3_expand/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_3_expand_relu/Relu6_WireFrameModel_with_alpha/block_3_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_3_expand/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "Conv__372:0"
    output: "WireFrameModel_with_alpha/decoder_fpn/upblock_2/conv_bn__act_8/re_lu_8/Relu_WireFrameModel_with_alpha/decoder_fpn/upblock_2/conv_bn__act_8/bn/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv_bn__act_17/conv/Conv2D_WireFrameModel_with_alpha/decoder_fpn/upblock_2/conv_bn__act_8/conv/Conv2D:0"
    name: "WireFrameModel_with_alpha/decoder_fpn/upblock_2/conv_bn__act_8/re_lu_8/Relu_WireFrameModel_with_alpha/decoder_fpn/upblock_2/conv_bn__act_8/bn/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv_bn__act_17/conv/Conv2D_WireFrameModel_with_alpha/decoder_fpn/upblock_2/conv_bn__act_8/conv/Conv2D"
    op_type: "Relu"
  }
  node {
    input: "WireFrameModel_with_alpha/block_3_expand_relu/Relu6_WireFrameModel_with_alpha/block_3_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise_WireFrameModel_with_alpha/block_3_expand/Conv2D:0"
    input: "const_fold_opt__396"
    input: "Add_7/y:0"
    output: "Conv__298:0"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 144
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Conv__298:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_3_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise:0"
    name: "WireFrameModel_with_alpha/block_3_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_3_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_3_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_3_depthwise/depthwise:0"
    input: "Conv2D_7/filter:0"
    input: "WireFrameModel_with_alpha/block_3_project_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_5_project/Conv2D_WireFrameModel_with_alpha/block_3_project/Conv2D1/y:0"
    output: "Conv__299:0"
    name: "Conv__299"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__299:0"
    input: "Conv2D_8/filter:0"
    input: "Add_8/y:0"
    output: "Conv__302:0"
    name: "Conv__302"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__302:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D:0"
    input: "const_fold_opt__400"
    input: "Add_9/y:0"
    output: "Conv__303:0"
    name: "Conv__303"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Conv__303:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_4_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_4_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_depthwise/depthwise:0"
    name: "WireFrameModel_with_alpha/block_4_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_4_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_depthwise/depthwise"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_4_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_4_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_depthwise/depthwise:0"
    input: "Conv2D_9/filter:0"
    input: "WireFrameModel_with_alpha/block_4_project_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_5_project/Conv2D_WireFrameModel_with_alpha/block_4_project/Conv2D1/y:0"
    output: "Conv__304:0"
    name: "Conv__304"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__299:0"
    input: "Conv__304:0"
    output: "WireFrameModel_with_alpha/block_4_add/add:0"
    name: "WireFrameModel_with_alpha/block_4_add/add"
    op_type: "Add"
  }
  node {
    input: "WireFrameModel_with_alpha/block_4_add/add:0"
    input: "Conv2D_10/filter:0"
    input: "Add_10/y:0"
    output: "Conv__307:0"
    name: "Conv__307"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__307:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_5_expand_relu/Relu6_WireFrameModel_with_alpha/block_5_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_5_expand/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_5_expand_relu/Relu6_WireFrameModel_with_alpha/block_5_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_5_expand/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_5_expand_relu/Relu6_WireFrameModel_with_alpha/block_5_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_5_expand/Conv2D:0"
    input: "const_fold_opt__398"
    input: "Add_11/y:0"
    output: "Conv__308:0"
    name: "Conv__308"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Conv__308:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_5_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_5_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_5_depthwise/depthwise:0"
    name: "WireFrameModel_with_alpha/block_5_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_5_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_5_depthwise/depthwise"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_5_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_5_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_5_depthwise/depthwise:0"
    input: "Conv2D_11/filter:0"
    input: "WireFrameModel_with_alpha/block_5_project_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_5_project/Conv2D1/y:0"
    output: "Conv__309:0"
    name: "Conv__309"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "WireFrameModel_with_alpha/block_4_add/add:0"
    input: "Conv__309:0"
    output: "WireFrameModel_with_alpha/block_5_add/add:0"
    name: "WireFrameModel_with_alpha/block_5_add/add"
    op_type: "Add"
  }
  node {
    input: "WireFrameModel_with_alpha/block_5_add/add:0"
    input: "Conv2D_31/filter:0"
    input: "Add_31/y:0"
    output: "Conv__310:0"
    name: "Conv__310"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "WireFrameModel_with_alpha/block_5_add/add:0"
    input: "Conv2D_12/filter:0"
    input: "Add_12/y:0"
    output: "Conv__315:0"
    name: "Conv__315"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__310:0"
    output: "WireFrameModel_with_alpha/decoder_fpn/upblock_1/conv_bn__act_4/re_lu_4/Relu_WireFrameModel_with_alpha/decoder_fpn/upblock_1/conv_bn__act_4/bn/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv_bn__act_17/conv/Conv2D_WireFrameModel_with_alpha/decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D:0"
    name: "WireFrameModel_with_alpha/decoder_fpn/upblock_1/conv_bn__act_4/re_lu_4/Relu_WireFrameModel_with_alpha/decoder_fpn/upblock_1/conv_bn__act_4/bn/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv_bn__act_17/conv/Conv2D_WireFrameModel_with_alpha/decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D"
    op_type: "Relu"
  }
  node {
    input: "Conv__315:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_6_expand_relu/Relu6_WireFrameModel_with_alpha/block_6_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_6_expand/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_6_expand_relu/Relu6_WireFrameModel_with_alpha/block_6_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_6_expand/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_6_expand_relu/Relu6_WireFrameModel_with_alpha/block_6_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_6_expand/Conv2D:0"
    input: "const_fold_opt__415"
    input: "Add_13/y:0"
    output: "Conv__318:0"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Conv__318:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_6_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise:0"
    name: "WireFrameModel_with_alpha/block_6_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_6_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise:0"
    input: "Conv2D_13/filter:0"
    input: "WireFrameModel_with_alpha/block_6_project_BN/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv_bn__act_17/conv/Conv2D_WireFrameModel_with_alpha/block_6_project/Conv2D1/y:0"
    output: "Conv__319:0"
    name: "Conv__319"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__319:0"
    input: "Conv2D_14/filter:0"
    input: "Add_14/y:0"
    output: "Conv__322:0"
    name: "Conv__322"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__322:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_7_expand_relu/Relu6_WireFrameModel_with_alpha/block_7_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_7_expand/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_7_expand_relu/Relu6_WireFrameModel_with_alpha/block_7_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_7_expand/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_7_expand_relu/Relu6_WireFrameModel_with_alpha/block_7_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_7_expand/Conv2D:0"
    input: "const_fold_opt__414"
    input: "Add_15/y:0"
    output: "Conv__323:0"
    name: "Conv__323"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 384
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Conv__323:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_7_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_7_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_7_depthwise/depthwise:0"
    name: "WireFrameModel_with_alpha/block_7_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_7_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_7_depthwise/depthwise"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_7_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_7_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_7_depthwise/depthwise:0"
    input: "Conv2D_15/filter:0"
    input: "WireFrameModel_with_alpha/block_7_project_BN/FusedBatchNormV3_WireFrameModel_with_alpha/Decoder/conv_bn__act_17/conv/Conv2D_WireFrameModel_with_alpha/block_7_project/Conv2D1/y:0"
    output: "Conv__324:0"
    name: "Conv__324"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__319:0"
    input: "Conv__324:0"
    output: "WireFrameModel_with_alpha/block_7_add/add:0"
    name: "WireFrameModel_with_alpha/block_7_add/add"
    op_type: "Add"
  }
  node {
    input: "WireFrameModel_with_alpha/block_7_add/add:0"
    input: "Conv2D_16/filter:0"
    input: "Add_16/y:0"
    output: "Conv__327:0"
    name: "Conv__327"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "Conv__327:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_8_expand_relu/Relu6_WireFrameModel_with_alpha/block_8_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_8_expand/Conv2D:0"
    name: "WireFrameModel_with_alpha/block_8_expand_relu/Relu6_WireFrameModel_with_alpha/block_8_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_8_expand/Conv2D"
    op_type: "Clip"
  }
  node {
    input: "WireFrameModel_with_alpha/block_8_expand_relu/Relu6_WireFrameModel_with_alpha/block_8_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_8_expand/Conv2D:0"
    input: "const_fold_opt__413"
    input: "Add_17/y:0"
    output: "Conv__328:0"
    name: "Conv__328"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 384
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "Conv__328:0"
    input: "WireFrameModel_with_alpha/block_1_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_1_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_1_depthwise/depthwise_WireFrameModel_with_alpha/block_12_project/Conv2D_min__38"
    input: "WireFrameModel_with_alpha/block_4_expand_relu/Relu6_WireFrameModel_with_alpha/block_4_expand_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_6_depthwise/depthwise_WireFrameModel_with_alpha/block_4_expand/Conv2D_max__75"
    output: "WireFrameModel_with_alpha/block_8_depthwise_relu/Relu6_WireFrameModel_with_alpha/block_8_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise_BN/FusedBatchNormV3_WireFrameModel_with_alpha/block_10_depthwise/depthwise_WireFrameModel_with_alpha/block_8_depthwise/depthwise:0"
